/*====================================================

【TypeScript入門 #1】Reactをベースにして学ぶ実践的で分かりやすいTypeScript講座が始まります

====================================================*/

/*====================================================

なぜ、TypeScriptが必要か？

====================================================*/

// type Props = {
//   text: string;
// };

// const Title = (props: Props) => {
//   return <h1>{props.text}</h1>;
// };

// export const Card = () => {
//   return <Title text="test" />;
// };
