/*====================================================

【TypeScript入門 #4】動的型付け・静的型付け、プリミティブ型とオブジェクト、nullとundefinedの使い分け

====================================================*/

/*====================================================

真偽値(Boolean)

====================================================*/

// const foo: boolean = true;
// const bar: boolean = false;
// const baz: boolean = "";

/*====================================================

文字列(String)

====================================================*/

// const foo: string = "aaa";
// const bar: string = ``;
// const baz: string = 111;

/*====================================================

数値(Number)

====================================================*/

// const foo: number = 123;
// const bar: number = 0.1;
// const baz: number = true;

/*====================================================

nullとundefined

====================================================*/

// const foo: null = null;
// const bar: null = undefined;

// const foo: undefined = undefined;
